In [ ]:
from git import Repo
import pandas as pd
import numpy as np
import os
import json
import pymysql

In [ ]:
# #Specify the GitHub repository URL and local directory path
github_url = "https://github.com/PhonePe/pulse.git"
local_dir = "C:/Phonepe_Pulse_Data"

# # Clone the repository to the specified local directory
Repo.clone_from(github_url, local_dir)

# Data Processing

In [ ]:
#------DATA-------AGGREGATED-------TRANSACTION---------#

In [ ]:
path_1="C:/Phonepe_Pulse_Data/data/aggregated/transaction/country/india/state"
agg_trans_state_list= os.listdir(path_1)

In [ ]:
Agg_trans = {'State': [], 'Year': [], 'Quarter': [], 'Transaction_type': [], 'Transaction_count': [], 'Transaction_amount': []}

In [5]:
for i in agg_trans_state_list:
    p_i = path_1 +"/"+ i + "/"
    agg_yr = os.listdir(p_i)
    for j in agg_yr:
        p_j = p_i + j + "/"
        agg_yr_list = os.listdir(p_j)
        for k in agg_yr_list:
            p_k = p_j + k
            data = open(p_k, 'r')
            A = json.load(data)
            
            for l in A['data']['transactionData']:
                Name=l['name']
                count=l['paymentInstruments'][0]['count']
                amount=l['paymentInstruments'][0]['amount']
                Agg_trans['State'].append(i)
                Agg_trans['Year'].append(j)
                Agg_trans['Quarter'].append(int(k.strip('.json')))
                Agg_trans['Transaction_type'].append(Name)
                Agg_trans['Transaction_count'].append(count)
                Agg_trans['Transaction_amount'].append(amount)
        
    
df_Agg_trans=pd.DataFrame(Agg_trans)

In [6]:
df_Agg_trans

,State,Year,Quarter,Transaction_type,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,Recharge & bill payments,4200,1.845307e+06
1,andaman-&-nicobar-islands,2018,1,Peer-to-peer payments,1871,1.213866e+07
2,andaman-&-nicobar-islands,2018,1,Merchant payments,298,4.525072e+05
3,andaman-&-nicobar-islands,2018,1,Financial Services,33,1.060142e+04
4,andaman-&-nicobar-islands,2018,1,Others,256,1.846899e+05
...,...,...,...,...,...,...
7903,west-bengal,2023,2,Merchant payments,245111000,1.767046e+11
7904,west-bengal,2023,2,Peer-to-peer payments,240347041,7.970548e+11
7905,west-bengal,2023,2,Recharge & bill payments,58950434,3.478924e+10
7906,west-bengal,2023,2,Financial Services,327537,3.174670e+08
7907,west-bengal,2023,2,Others,581674,4.489893e+08

In [7]:
df_Agg_trans.shape

(7908, 6)

In [8]:
df_Agg_trans.dtypes

State                  object
Year                   object
Quarter                 int64
Transaction_type       object
Transaction_count       int64
Transaction_amount    float64
dtype: object

In [9]:
data=df_Agg_trans.duplicated()

In [10]:
sum(data)

3954

In [11]:
df_Agg_trans.isnull().sum()

State                 0
Year                  0
Quarter               0
Transaction_type      0
Transaction_count     0
Transaction_amount    0
dtype: int64

In [12]:
df_Agg_trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7908 entries, 0 to 7907
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State               7908 non-null   object
 1   Year                7908 non-null   object
 2   Quarter             7908 non-null   int64
 3   Transaction_type    7908 non-null   object
 4   Transaction_count   7908 non-null   int64
 5   Transaction_amount  7908 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 370.8+ KB

In [13]:
df_Agg_trans.nunique()

State                   36
Year                     6
Quarter                  4
Transaction_type         5
Transaction_count     3902
Transaction_amount    3954
dtype: int64

In [14]:
#------DATA-------AGGREGATED-------USER--------------#

In [15]:
path_2="C:/Phonepe_Pulse_Data/data/aggregated/user/country/india/state"
agg_user_state_list= os.listdir(path_2)

In [16]:
Agg_user = {'State': [], 'Year': [], 'Quarter': [], 'Brands': [], 'User_Count': [], 'User_Percentage': []}

In [17]:
for i in agg_user_state_list:
    p_i = path_2 +"/"+ i + "/"
    Agg_yr = os.listdir(p_i)

    for j in Agg_yr:
        p_j = p_i + j + "/"
        Agg_yr_list = os.listdir(p_j)

        for k in Agg_yr_list:
            p_k = p_j + k
            data = open(p_k, 'r')
            B = json.load(data) 
                        
            try:
                for l in B["data"]["usersByDevice"]:
                    brand_name = l["brand"]
                    count_ = l["count"]
                    ALL_percentage = l["percentage"]
                    Agg_user["State"].append(i)
                    Agg_user["Year"].append(j)
                    Agg_user["Quarter"].append(int(k.strip('.json')))
                    Agg_user["Brands"].append(brand_name)
                    Agg_user["User_Count"].append(count_)
                    Agg_user["User_Percentage"].append(ALL_percentage*100)
            except:
                pass

In [18]:
df_Agg_user=pd.DataFrame(Agg_user)

In [19]:
df_Agg_user

,State,Year,Quarter,Brands,User_Count,User_Percentage
0,andaman-&-nicobar-islands,2018,1,Xiaomi,1665,24.703264
1,andaman-&-nicobar-islands,2018,1,Samsung,1445,21.439169
2,andaman-&-nicobar-islands,2018,1,Vivo,982,14.569733
3,andaman-&-nicobar-islands,2018,1,Oppo,501,7.433234
4,andaman-&-nicobar-islands,2018,1,OnePlus,332,4.925816
...,...,...,...,...,...,...
6727,west-bengal,2022,1,Lenovo,330017,1.505567
6728,west-bengal,2022,1,Infinix,284678,1.298726
6729,west-bengal,2022,1,Asus,280347,1.278968
6730,west-bengal,2022,1,Apple,277752,1.267129
6731,west-bengal,2022,1,Others,2196334,10.019869

In [20]:
df_Agg_user.shape

(6732, 6)

In [21]:
df_Agg_user.dtypes

State               object
Year                object
Quarter              int64
Brands              object
User_Count           int64
User_Percentage    float64
dtype: object

In [22]:
data=df_Agg_user.duplicated()
sum(data)

0

In [23]:
df_Agg_user.isnull().sum()

State              0
Year               0
Quarter            0
Brands             0
User_Count         0
User_Percentage    0
dtype: int64

In [24]:
df_Agg_user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6732 entries, 0 to 6731
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   State            6732 non-null   object
 1   Year             6732 non-null   object
 2   Quarter          6732 non-null   int64
 3   Brands           6732 non-null   object
 4   User_Count       6732 non-null   int64
 5   User_Percentage  6732 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 315.7+ KB

In [25]:
df_Agg_user.nunique()

State                36
Year                  5
Quarter               4
Brands               20
User_Count         6501
User_Percentage    6726
dtype: int64

In [26]:
#--------------DATA----MAP-------TRANSACTION-------------#

In [27]:
path_3="C:/Phonepe_Pulse_Data/data/map/transaction/hover/country/india/state"
map_trans_state_list= os.listdir(path_3)

In [28]:
map_trans = {'State': [], 'Year': [], 'Quarter': [], 'District': [], 'Transaction_Count': [], 'Transaction_Amount': []}

In [29]:
for i in map_trans_state_list:
    p_i = path_3 +'/'+ i + "/"
    Agg_yr = os.listdir(p_i)

    for j in Agg_yr:
        p_j = p_i + j + "/"
        Agg_yr_list = os.listdir(p_j)

        for k in Agg_yr_list:
            p_k = p_j + k
            data = open(p_k, 'r')
            C = json.load(data)
            for l in C["data"]["hoverDataList"]:
                District = l["name"]
                count = l["metric"][0]["count"]
                amount = l["metric"][0]["amount"]
                map_trans['State'].append(i)
                map_trans['Year'].append(j)
                map_trans['Quarter'].append(int(k.strip('.json')))
                map_trans["District"].append(District)
                map_trans["Transaction_Count"].append(count)
                map_trans["Transaction_Amount"].append(amount)

In [30]:
df_map_trans=pd.DataFrame(map_trans)
df_map_trans

,State,Year,Quarter,District,Transaction_Count,Transaction_Amount
0,andaman-&-nicobar-islands,2018,1,north and middle andaman district,442,9.316631e+05
1,andaman-&-nicobar-islands,2018,1,south andaman district,5688,1.256025e+07
2,andaman-&-nicobar-islands,2018,1,nicobars district,528,1.139849e+06
3,andaman-&-nicobar-islands,2018,2,north and middle andaman district,825,1.317863e+06
4,andaman-&-nicobar-islands,2018,2,south andaman district,9395,2.394824e+07
...,...,...,...,...,...,...
16095,west-bengal,2023,2,nadia district,26194658,5.410386e+10
16096,west-bengal,2023,2,birbhum district,14912523,2.941312e+10
16097,west-bengal,2023,2,purba medinipur district,30724502,6.595899e+10
16098,west-bengal,2023,2,maldah district,24677357,5.218621e+10
16099,west-bengal,2023,2,darjiling district,13049366,2.372866e+10

In [31]:
df_map_trans.shape

(16100, 6)

In [32]:
df_map_trans.dtypes

State                  object
Year                   object
Quarter                 int64
District               object
Transaction_Count       int64
Transaction_Amount    float64
dtype: object

In [33]:
data=df_map_trans.duplicated()
sum(data)

0

In [34]:
df_map_trans.isnull().sum()

State                 0
Year                  0
Quarter               0
District              0
Transaction_Count     0
Transaction_Amount    0
dtype: int64

In [35]:
df_map_trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16100 entries, 0 to 16099
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State               16100 non-null  object
 1   Year                16100 non-null  object
 2   Quarter             16100 non-null  int64
 3   District            16100 non-null  object
 4   Transaction_Count   16100 non-null  int64
 5   Transaction_Amount  16100 non-null  float64
dtypes: float64(1), int64(2), object(3)
memory usage: 754.8+ KB

In [36]:
df_map_trans.nunique()

State                    36
Year                      6
Quarter                   4
District                723
Transaction_Count     16025
Transaction_Amount    16100
dtype: int64

In [37]:
#--------------DATA----MAP-------USER-------------#

In [38]:
path_4="C:/Phonepe_Pulse_Data/data/map/user/hover/country/india/state"

In [39]:
map_user_state_list= os.listdir(path_3)

In [40]:
map_user = {"State": [], "Year": [], "Quarter": [], "District": [], "Registered_User": []}

In [41]:
for i in map_user_state_list:
    p_i = path_4 +"/"+i + "/"
    Agg_yr = os.listdir(p_i)
    for j in Agg_yr:
        p_j = p_i + j + "/"
        Agg_yr_list = os.listdir(p_j)

        for k in Agg_yr_list:
            p_k = p_j + k
            Data = open(p_k, 'r')
            D = json.load(Data)

            for l in D["data"]["hoverData"].items():
                district = l[0]
                registereduser = l[1]["registeredUsers"]
                map_user['State'].append(i)
                map_user['Year'].append(j)
                map_user['Quarter'].append(int(k.strip('.json')))
                map_user["District"].append(district)
                map_user["Registered_User"].append(registereduser)

In [42]:
df_map_user=pd.DataFrame(map_user)
df_map_user

,State,Year,Quarter,District,Registered_User
0,andaman-&-nicobar-islands,2018,1,north and middle andaman district,632
1,andaman-&-nicobar-islands,2018,1,south andaman district,5846
2,andaman-&-nicobar-islands,2018,1,nicobars district,262
3,andaman-&-nicobar-islands,2018,2,north and middle andaman district,911
4,andaman-&-nicobar-islands,2018,2,south andaman district,8143
...,...,...,...,...,...
16099,west-bengal,2023,2,nadia district,1482400
16100,west-bengal,2023,2,birbhum district,934943
16101,west-bengal,2023,2,purba medinipur district,1468608
16102,west-bengal,2023,2,maldah district,1046132
16103,west-bengal,2023,2,darjiling district,613398

In [43]:
df_map_user.shape

(16104, 5)

In [44]:
df_map_user.dtypes

State              object
Year               object
Quarter             int64
District           object
Registered_User     int64
dtype: object

In [45]:
data=df_map_user.duplicated()
sum(data)

0

In [46]:
df_map_user.isnull().sum()

State              0
Year               0
Quarter            0
District           0
Registered_User    0
dtype: int64

In [47]:
df_map_user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16104 entries, 0 to 16103
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   State            16104 non-null  object
 1   Year             16104 non-null  object
 2   Quarter          16104 non-null  int64
 3   District         16104 non-null  object
 4   Registered_User  16104 non-null  int64
dtypes: int64(2), object(3)
memory usage: 629.2+ KB

In [48]:
df_map_user.nunique()

State                 36
Year                   6
Quarter                4
District             723
Registered_User    15777
dtype: int64

In [49]:
#--------------DATA----TOP-------TRANSACTION-------------#

In [50]:
path_5="C:/Phonepe_Pulse_Data/data/top/transaction/country/india/state"

In [51]:
top_trans_state_list = os.listdir(path_5)

In [52]:
top_trans = {'State': [], 'Year': [], 'Quarter': [], 'District_Pincode': [], 'Transaction_count': [], 'Transaction_amount': []}

In [53]:
for i in top_trans_state_list:
    p_i = path_5 +"/"+ i + "/"
    Agg_yr = os.listdir(p_i)

    for j in Agg_yr:
        p_j = p_i + j + "/"
        Agg_yr_list = os.listdir(p_j)

        for k in Agg_yr_list:
            p_k = p_j + k
            Data = open(p_k, 'r')
            E = json.load(Data)
            
            for l in E['data']['pincodes']:
                Name = l['entityName']
                count = l['metric']['count']
                amount = l['metric']['amount']
                top_trans['State'].append(i)
                top_trans['Year'].append(j)
                top_trans['Quarter'].append(int(k.strip('.json')))
                top_trans['District_Pincode'].append(Name)
                top_trans['Transaction_count'].append(count)
                top_trans['Transaction_amount'].append(amount)

In [54]:
df_top_trans=pd.DataFrame(top_trans)
df_top_trans

,State,Year,Quarter,District_Pincode,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,744101,1622,2.769298e+06
1,andaman-&-nicobar-islands,2018,1,744103,1223,2.238042e+06
2,andaman-&-nicobar-islands,2018,1,744102,969,3.519060e+06
3,andaman-&-nicobar-islands,2018,1,744105,685,1.298561e+06
4,andaman-&-nicobar-islands,2018,1,744104,340,1.039715e+06
...,...,...,...,...,...,...
7848,west-bengal,2023,2,700001,2918444,6.259877e+09
7849,west-bengal,2023,2,721301,2910870,4.458107e+09
7850,west-bengal,2023,2,700039,2886562,4.662887e+09
7851,west-bengal,2023,2,700015,2774383,4.372975e+09
7852,west-bengal,2023,2,700014,2757479,5.108638e+09

In [55]:
df_top_trans.shape

(7853, 6)

In [56]:
df_top_trans.dtypes

State                  object
Year                   object
Quarter                 int64
District_Pincode       object
Transaction_count       int64
Transaction_amount    float64
dtype: object

In [57]:
data=df_top_trans.duplicated()
sum(data)

0

In [58]:
df_top_trans.isnull().sum()

State                 0
Year                  0
Quarter               0
District_Pincode      2
Transaction_count     0
Transaction_amount    0
dtype: int64

In [59]:
df_top_trans.dropna(inplace=True)

In [60]:
df_top_trans.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7851 entries, 0 to 7852
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State               7851 non-null   object
 1   Year                7851 non-null   object
 2   Quarter             7851 non-null   int64
 3   District_Pincode    7851 non-null   object
 4   Transaction_count   7851 non-null   int64
 5   Transaction_amount  7851 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 429.4+ KB

In [61]:
df_top_trans.nunique()

State                   36
Year                     6
Quarter                  4
District_Pincode       768
Transaction_count     7793
Transaction_amount    7851
dtype: int64

In [62]:
#--------------DATA----TOP-------USER-------------#

In [63]:
path_6="C:/Phonepe_Pulse_Data/data/top/user/country/india/state"

In [64]:
top_user_state_list = os.listdir(path_6)

In [65]:
top_user = {'State': [], 'Year': [], 'Quarter': [], 'District_Pincode': [], 'Registered_User': []}

In [66]:
for i in top_user_state_list:
    p_i = path_6 +"/"+ i + "/"
    Agg_yr = os.listdir(p_i)

    for j in Agg_yr:
        p_j = p_i + j + "/"
        Agg_yr_list = os.listdir(p_j)

        for k in Agg_yr_list:
            p_k = p_j + k
            Data = open(p_k, 'r')
            F = json.load(Data)
            
            for l in F['data']['pincodes']:
                Name = l['name']
                registeredUser = l['registeredUsers']
                top_user['State'].append(i)
                top_user['Year'].append(j)
                top_user['Quarter'].append(int(k.strip('.json')))
                top_user['District_Pincode'].append(Name)
                top_user['Registered_User'].append(registeredUser)

In [67]:
df_top_user=pd.DataFrame(top_user)
df_top_user

,State,Year,Quarter,District_Pincode,Registered_User
0,andaman-&-nicobar-islands,2018,1,744103,1608
1,andaman-&-nicobar-islands,2018,1,744101,1108
2,andaman-&-nicobar-islands,2018,1,744105,1075
3,andaman-&-nicobar-islands,2018,1,744102,1006
4,andaman-&-nicobar-islands,2018,1,744104,272
...,...,...,...,...,...
7849,west-bengal,2023,2,700015,117690
7850,west-bengal,2023,2,742304,114746
7851,west-bengal,2023,2,721101,114293
7852,west-bengal,2023,2,700150,110694
7853,west-bengal,2023,2,700091,110637

In [68]:
df_top_user.shape

(7854, 5)

In [69]:
df_top_user.dtypes

State               object
Year                object
Quarter              int64
District_Pincode    object
Registered_User      int64
dtype: object

In [70]:
d=df_top_user.duplicated()
sum(d)

0

In [71]:
df_top_user.isnull().sum()

State               0
Year                0
Quarter             0
District_Pincode    0
Registered_User     0
dtype: int64

In [72]:
df_top_user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7854 entries, 0 to 7853
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   State             7854 non-null   object
 1   Year              7854 non-null   object
 2   Quarter           7854 non-null   int64
 3   District_Pincode  7854 non-null   object
 4   Registered_User   7854 non-null   int64
dtypes: int64(2), object(3)
memory usage: 306.9+ KB

In [73]:
df_top_user.nunique()

State                 36
Year                   6
Quarter                4
District_Pincode     428
Registered_User     7559
dtype: int64

In [ ]:
#  --------    CONNECT SQL SERVER  /   CREAT DATA BASE    /  CREAT TABLE    /    STORE DATA -------- #

In [74]:
myconnection=pymysql.connect(host='127.0.0.1',user='root',passwd='atx1c1d1')

In [75]:
cur=myconnection.cursor()

In [76]:
cur.execute("create database if not exists phonepe_pulse")

1

In [77]:
myconnection=pymysql.connect(host='127.0.0.1',user='root',passwd='atx1c1d1',database='phonepe_pulse')

In [78]:
cur=myconnection.cursor()

In [79]:
cur.execute("create table if not exists aggregated_transaction(State varchar(100),Year int,Quarter int,Transaction_type varchar(100),Transaction_count int,Transaction_amount float)")

0

In [80]:
sql = "insert into aggregated_transaction(State,Year,Quarter,Transaction_type,Transaction_count,Transaction_amount) values (%s,%s,%s,%s,%s,%s)"
for i in range(0,len(df_Agg_trans)):
        cur.execute(sql,tuple(df_Agg_trans.iloc[i]))
        myconnection.commit()

In [81]:
cur.execute("create table if not exists aggregated_user(State varchar(100),Year int,Quarter int,Brands varchar(100),User_Count int,User_Percentage float)")

0

In [82]:
sql = "insert into aggregated_user(State,Year,Quarter,Brands,User_count,User_Percentage) values (%s,%s,%s,%s,%s,%s)"
for i in range(0,len(df_Agg_user)):
        cur.execute(sql,tuple(df_Agg_user.iloc[i]))
        myconnection.commit()

In [83]:
cur.execute("create table if not exists map_transaction(State varchar(100),Year int,Quarter int,District varchar(100),Transaction_Count int,Transaction_Amount float)")

0

In [84]:
sql = "insert into map_transaction(State,Year,Quarter,District,Transaction_Count,Transaction_Amount) values (%s,%s,%s,%s,%s,%s)"
for i in range(0,len(df_map_trans)):
        cur.execute(sql,tuple(df_map_trans.iloc[i]))
        myconnection.commit()

In [85]:
cur.execute("create table if not exists map_user(State varchar(100),Year int,Quarter int,District varchar(100),Registered_User int)")

0

In [86]:
sql = "insert into map_user(State,Year,Quarter,District,Registered_User) values (%s,%s,%s,%s,%s)"
for i in range(0,len(df_map_user)):
        cur.execute(sql,tuple(df_map_user.iloc[i]))
        myconnection.commit()

In [87]:
cur.execute("create table if not exists top_transaction(State varchar(100),Year int,Quarter int,District_Pincode int,Transaction_count int,Transaction_amount float)")

0

In [88]:
sql = "insert into top_transaction(State,Year,Quarter,District_Pincode,Transaction_count,Transaction_amount) values (%s,%s,%s,%s,%s,%s)"
for i in range(0,len(df_top_trans)):
        cur.execute(sql,tuple(df_top_trans.iloc[i]))
        myconnection.commit()

In [89]:
cur.execute("create table if not exists top_user(State varchar(100),Year int,Quarter int,District_Pincode int,Registered_User int)")

0

In [90]:
sql = "insert into top_user(State,Year,Quarter,District_Pincode,Registered_User) values (%s,%s,%s,%s,%s)"
for i in range(0,len(df_top_user)):
        cur.execute(sql,tuple(df_top_user.iloc[i]))
        myconnection.commit()